#Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.
#- 6 -> да
#- 7 -> да
#- 1 -> нет

print('введите число - ')
a = int(input())
if a == 1 or a == 2 or a == 3 or a == 3 or a == 4 or a == 5:
    print('no')
elif a == 6 or a == 7:
    print('yes')
else:
    print('введеное число не является днем недели')