#Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).
#- x=34; y=-30 -> 4
#- x=2; y=4-> 1
#- x=-34; y=-30 -> 3

print('введите координату x -')
x = int(input())
print('введите коордитату y -')
y = int(input())
if x > 0 and y > 0:
    print ('омер четверти плоскости - 1')
elif x > 0 and y < 0:
    print ('омер четверти плоскости - 2')
elif x < 0 and y < 0:
    print('омер четверти плоскости - 3')
else:
    print('омер четверти плоскости - 4')