#Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
#- A (3,6); B (2,1) -> 5,09
#- A (7,-5); B (1,-1) -> 7,21

print('введите значение координаты x точки а - ')
x = int(input())
print('введите значение координаты y точки а - ')
y = int(input())
print('введите значение координаты x точки b - ')
xb = int(input())
print('введите значение координаты y точки b - ')
yb = int(input())
import math
d = (xb-x)*(xb-x)+(yb-y)*(yb-y)
sqrt = math.sqrt(d)
print(sqrt)